export const schedules = {
  "2025-02": {
    1: [
      { text: "1학기 정기주차권 신청(인터넷, 행정실)", department: "행정실" },
      {
        text: "신입/복학생 예비군 전입신청(홈페이지>예비군)",
        department: "예비군",
      },
    ],
    3: [{ text: "석·박사 종합시험 재시험", department: "교학실(대학원)" }],
    4: [{ text: "수강신청(전체)", department: "교학실" }],
    5: [
      { text: "신학입문(신대원 신학과 신입생)", department: "교학실(신대원)" },
    ],
    10: [{ text: "수시, 정시 합격자 등록", department: "교학실(대학)" }],
    11: [{ text: "수업계획서 수정(전체)", department: "교학실" }],
    13: [
      { text: "제118회 전기 학위수여식", department: "교학실" },
      { text: "정시 미등록 충원(합격자발표)", department: "교학실" },
    ],
    17: [
      { text: "1차 등록금 납부", department: "행정실(경리)" },
      { text: "장서점검", department: "학술연구지원실(도서관)" },
      {
        text: "수강신청 변경 및 신입생, 복학생 수강신청",
        department: "교학실(대학원)",
      },
      { text: "논문 추가신청", department: "교학실(대학원)" },
    ],
    20: [{ text: "온라인 1학기 뉴스레터 게재", department: "학생생활상담소" }],
    21: [{ text: "개강교수회의", department: "교학실(신대원)" }],
    24: [
      { text: "조교교육", department: "교수학습개발원" },
      { text: "입학 및 개강감사예배", department: "교학실(대학원)" },
    ],
    25: [
      { text: "가르침에 관한 성찰", department: "교수학습개발원" },
      {
        text: "입학감사예배 및 신입생 오리엔테이션",
        department: "교학실(대학, 신대원)",
      },
    ],
    27: [
      { text: "신입생 수강신청", department: "교학실(신대원)" },
      { text: "학점인정 신청", department: "교학실(신대원)" },
      {
        text: "재학생 수강신청 변경 및 신입생 수강 신청",
        department: "교학실(대학)",
      },
    ],
  },
  "2025-03": {
    4: [
      { text: "개강", department: "교학실(대학, 신대원)" },
      {
        text: "개강감사예배(10:30)",
        department: "교학실(대학, 신대원), 경건교육실",
      },
      { text: "리더십아카데미(23기) 개강감사예배", department: "평생교육원" },
    ],
    5: [{ text: "신학생활3 오리엔테이션", department: "학생지원실" }],
    6: [
      { text: "교음과 추가시험", department: "교학실(대학, 신대원, 대학원)" },
    ],
    10: [{ text: "개강감사예배", department: "평생교육원" }],
    12: [{ text: "대학생활 첫모임", department: "교학실(대학)" }],
    13: [
      {
        text: "장애학생 오찬만남 및 학습튜터 활동안내",
        department: "교수학습개발원",
      },
    ],
    17: [{ text: "수업 1/5선", department: "교학실(대학원)" }],
    19: [
      { text: "진로연계 첫모임", department: "교학실(대학)" },
      { text: "신학생활 모임", department: "교학실(신대원)" },
    ],
    25: [
      { text: "수업 1/5선", department: "교학실(대학, 신대원)" },
      {
        text: "두런두런 학습공동체 오리엔테이션",
        department: "교수학습개발원",
      },
    ],
    26: [
      { text: "봄 신앙사경회", department: "경건교육실, 교학실(대학, 신대원)" },
    ],
    28: [{ text: "응급처치 및 심폐소생술 교육", department: "교학실(대학)" }],
    31: [{ text: "학교현장실습 1차", department: "교학실(대학)" }],
  },
  "2025-04": {
    2: [
      { text: "신학생활 모임", department: "교학실(신대원)" },
      { text: "길거리 글쓰기코칭", department: "교수학습개발원" },
    ],
    4: [{ text: "논문지도교수선정", department: "교학실(신대원)" }],
    18: [
      { text: "성금요일예배", department: "경건교육실" },
      { text: "정기교수회의", department: "교학실(신대원)" },
    ],
    22: [
      { text: "부활절예배", department: "경건교육실" },
      { text: "중간고사", department: "교학실(대학, 신대원)" },
    ],
    23: [{ text: "신학생활 모임", department: "교학실(신대원)" }],
    25: [{ text: "신학대학원 입학설명회", department: "교학실(신대원)" }],
    30: [
      { text: "신학생활4 학생 오리엔테이션", department: "학생지원실" },
      { text: "교직적성 및 인성검사", department: "교학실(대학)" },
      { text: "학습법 특강", department: "교수학습개발원" },
    ],
  },
  "2025-05": {
    1: [{ text: "제124주년 개교기념 휴무일", department: "기획실" }],
    8: [{ text: "신학생활 모임", department: "교학실(신대원)" }],
    12: [{ text: "신대원 93기 홈커밍데이", department: "대외협력실" }],
    13: [
      { text: "괜찮니? 우체통", department: "학생생활상담소" },
      { text: "리더십아카데미(23기) 종강감사예배", department: "평생교육원" },
      {
        text: "제25회 장로회신학대학교 개교기념 학술대회",
        department: "학술연구지원실",
      },
      { text: "개교 124주년기념 감사예배(10:30)", department: "기획실" },
    ],
    20: [
      {
        text: "남북한평화신학연구소 개소 13주년",
        department: "남북한평화신학연구소",
      },
    ],
    21: [{ text: "신학생활 모임", department: "교학실(신대원)" }],
    26: [
      { text: "종강감사예배", department: "평생교육원" },
      { text: "형식심사용 논문 제출", department: "교학실(대학원)" },
    ],
  },
  "2025-06": {
    2: [{ text: "개소 26주년 기념 예배", department: "학생생활상담소" }],
    5: [
      {
        text: "종강감사예배(10:30)",
        department: "경건교육실, 교학실(대학, 신대원)",
      },
    ],
    6: [{ text: "대학원 종강", department: "교학실(대학원)" }],
    10: [{ text: "기말고사 및 종강", department: "교학실(대학, 신대원)" }],
    16: [
      { text: "후기 대학원 전형일", department: "교학실(대학원)" },
      { text: "멀티미디어 활용교육", department: "교수학습개발원" },
    ],
    23: [
      { text: "신대원 통합수련회", department: "교학실(신대원)" },
      { text: "여름 사이버강의 계절학기 개강", department: "교학실(대학)" },
    ],
    26: [{ text: "후기 대학원 합격자 발표", department: "교학실(대학원)" }],
    30: [{ text: "서울오라토리오페스티발", department: "교학실(대학)" }],
  },
  "2025-07": {
    1: [{ text: "재학생 성경종합고사", department: "교학실(대학, 신대원)" }],
    7: [
      { text: "석사, 목회신학박사 종합시험", department: "교학실(대학원)" },
      { text: "신학박사 종합시험", department: "교학실(대학원)" },
      { text: "재입학 신청", department: "교학실(대학)" },
    ],
    14: [{ text: "석·박사과정 외국어시험", department: "교학실(대학원)" }],
    23: [{ text: "후기 대학원 등록", department: "교학실(대학원)" }],
    25: [{ text: "제124주년 개교기념 대체휴무일", department: "행정실" }],
    28: [
      {
        text: "계절학기 성적열람 및 성적 이의 신청",
        department: "교학실(대학)",
      },
    ],
  },
  "2025-08": {
    1: [{ text: "수강신청", department: "교학실(대학, 신대원, 대학원)" }],
    4: [{ text: "석·박사과정 종합시험 재시험", department: "교학실(대학원)" }],
    7: [
      { text: "제118회 후기 졸업", department: "교학실(대학, 신대원, 대학원)" },
    ],
    11: [
      { text: "장서정검", department: "학술연구지원실(도서관)" },
      { text: "논문 추가신청기간", department: "교학실(대학원)" },
    ],
    18: [
      { text: "조교교육", department: "교수학습개발원" },
      { text: "1차 등록금 납부", department: "행정실(경리)" },
    ],
    22: [{ text: "개강교수회의", department: "교학실(신대원)" }],
    25: [
      { text: "대학원 개강감사예배, 세미나", department: "교학실(대학원)" },
      { text: "개강", department: "교학실(대학, 신대원, 대학원)" },
    ],
    26: [
      {
        text: "개강감사예배(10:30)",
        department: "경건교육실, 교학실(대학, 신대원)",
      },
    ],
    28: [
      {
        text: "장애학생 오찬만남 및 학습튜터 활동안내",
        department: "교수학습개발원",
      },
      { text: "추가시험", department: "교학실(대학, 신대원, 대학원)" },
    ],
    29: [
      {
        text: "복학생 신학생활4 오리엔테이션 및 기관신청",
        department: "학생지원실",
      },
    ],
  },
  "2025-09": {
    1: [{ text: "개강감사예배", department: "평생교육원" }],
    3: [{ text: "대학생활 첫모임", department: "교학실(대학)" }],
    5: [{ text: "수업도우미교육", department: "교수학습개발원" }],
    10: [
      { text: "학습법 특강", department: "교수학습개발원" },
      { text: "신학생활 모임", department: "교학실(신대원)" },
      { text: "진로연계 첫모임", department: "교학실(대학)" },
    ],
    15: [{ text: "수업 1/5선", department: "교학실(대학, 신대원, 대학원)" }],
    16: [
      {
        text: "두런두런 학습공동체 오리엔테이션",
        department: "교수학습개발원",
      },
    ],
    17: [
      {
        text: "가을 신앙사경회",
        department: "경건교육실, 교학실(대학, 신대원)",
      },
    ],
    19: [{ text: "응급처치 및 심폐소생술 교육", department: "교학실(대학)" }],
    24: [
      { text: "제20회 춘계 이종성 신학강좌", department: "학술연구지원실" },
      { text: "교직 적성 및 인성검사", department: "교학실(대학)" },
    ],
  },
  "2025-02": {
    1: [
      { text: "1학기 정기주차권 신청(인터넷, 행정실)", department: "행정실" },
      {
        text: "신입/복학생 예비군 전입신청(홈페이지>예비군)",
        department: "예비군",
      },
    ],
    3: [{ text: "석·박사 종합시험 재시험", department: "교학실(대학원)" }],
    4: [{ text: "수강신청(전체)", department: "교학실" }],
    5: [
      { text: "신학입문(신대원 신학과 신입생)", department: "교학실(신대원)" },
    ],
    10: [{ text: "수시, 정시 합격자 등록", department: "교학실(대학)" }],
    11: [{ text: "수업계획서 수정(전체)", department: "교학실" }],
    13: [
      { text: "제118회 전기 학위수여식", department: "교학실" },
      { text: "정시 미등록 충원(합격자발표)", department: "교학실" },
    ],
    17: [
      { text: "1차 등록금 납부", department: "행정실(경리)" },
      { text: "장서점검", department: "학술연구지원실(도서관)" },
      {
        text: "수강신청 변경 및 신입생, 복학생 수강신청",
        department: "교학실(대학원)",
      },
      { text: "논문 추가신청", department: "교학실(대학원)" },
    ],
    20: [{ text: "온라인 1학기 뉴스레터 게재", department: "학생생활상담소" }],
    21: [{ text: "개강교수회의", department: "교학실(신대원)" }],
    24: [
      { text: "조교교육", department: "교수학습개발원" },
      { text: "입학 및 개강감사예배", department: "교학실(대학원)" },
    ],
    25: [
      { text: "가르침에 관한 성찰", department: "교수학습개발원" },
      {
        text: "입학감사예배 및 신입생 오리엔테이션",
        department: "교학실(대학, 신대원)",
      },
    ],
    27: [
      { text: "신입생 수강신청", department: "교학실(신대원)" },
      { text: "학점인정 신청", department: "교학실(신대원)" },
      {
        text: "재학생 수강신청 변경 및 신입생 수강 신청",
        department: "교학실(대학)",
      },
    ],
  },
  "2025-03": {
    4: [
      { text: "개강", department: "교학실(대학, 신대원)" },
      {
        text: "개강감사예배(10:30)",
        department: "교학실(대학, 신대원), 경건교육실",
      },
      { text: "리더십아카데미(23기) 개강감사예배", department: "평생교육원" },
    ],
    5: [{ text: "신학생활3 오리엔테이션", department: "학생지원실" }],
    6: [
      { text: "교음과 추가시험", department: "교학실(대학, 신대원, 대학원)" },
    ],
    10: [{ text: "개강감사예배", department: "평생교육원" }],
    12: [{ text: "대학생활 첫모임", department: "교학실(대학)" }],
    13: [
      {
        text: "장애학생 오찬만남 및 학습튜터 활동안내",
        department: "교수학습개발원",
      },
    ],
    17: [{ text: "수업 1/5선", department: "교학실(대학원)" }],
    19: [
      { text: "진로연계 첫모임", department: "교학실(대학)" },
      { text: "신학생활 모임", department: "교학실(신대원)" },
    ],
    25: [
      { text: "수업 1/5선", department: "교학실(대학, 신대원)" },
      {
        text: "두런두런 학습공동체 오리엔테이션",
        department: "교수학습개발원",
      },
    ],
    26: [
      { text: "봄 신앙사경회", department: "경건교육실, 교학실(대학, 신대원)" },
    ],
    28: [{ text: "응급처치 및 심폐소생술 교육", department: "교학실(대학)" }],
    31: [{ text: "학교현장실습 1차", department: "교학실(대학)" }],
  },
  "2025-04": {
    2: [
      { text: "신학생활 모임", department: "교학실(신대원)" },
      { text: "길거리 글쓰기코칭", department: "교수학습개발원" },
    ],
    4: [{ text: "논문지도교수선정", department: "교학실(신대원)" }],
    18: [
      { text: "성금요일예배", department: "경건교육실" },
      { text: "정기교수회의", department: "교학실(신대원)" },
    ],
    22: [
      { text: "부활절예배", department: "경건교육실" },
      { text: "중간고사", department: "교학실(대학, 신대원)" },
    ],
    23: [{ text: "신학생활 모임", department: "교학실(신대원)" }],
    25: [{ text: "신학대학원 입학설명회", department: "교학실(신대원)" }],
    30: [
      { text: "신학생활4 학생 오리엔테이션", department: "학생지원실" },
      { text: "교직적성 및 인성검사", department: "교학실(대학)" },
      { text: "학습법 특강", department: "교수학습개발원" },
    ],
  },
  "2025-05": {
    1: [{ text: "제124주년 개교기념 휴무일", department: "기획실" }],
    8: [{ text: "신학생활 모임", department: "교학실(신대원)" }],
    12: [{ text: "신대원 93기 홈커밍데이", department: "대외협력실" }],
    13: [
      { text: "괜찮니? 우체통", department: "학생생활상담소" },
      { text: "리더십아카데미(23기) 종강감사예배", department: "평생교육원" },
      {
        text: "제25회 장로회신학대학교 개교기념 학술대회",
        department: "학술연구지원실",
      },
      { text: "개교 124주년기념 감사예배(10:30)", department: "기획실" },
    ],
    20: [
      {
        text: "남북한평화신학연구소 개소 13주년",
        department: "남북한평화신학연구소",
      },
    ],
    21: [{ text: "신학생활 모임", department: "교학실(신대원)" }],
    26: [
      { text: "종강감사예배", department: "평생교육원" },
      { text: "형식심사용 논문 제출", department: "교학실(대학원)" },
    ],
  },
  "2025-06": {
    2: [{ text: "개소 26주년 기념 예배", department: "학생생활상담소" }],
    5: [
      {
        text: "종강감사예배(10:30)",
        department: "경건교육실, 교학실(대학, 신대원)",
      },
    ],
    6: [{ text: "대학원 종강", department: "교학실(대학원)" }],
    10: [{ text: "기말고사 및 종강", department: "교학실(대학, 신대원)" }],
    16: [
      { text: "후기 대학원 전형일", department: "교학실(대학원)" },
      { text: "멀티미디어 활용교육", department: "교수학습개발원" },
    ],
    23: [
      { text: "신대원 통합수련회", department: "교학실(신대원)" },
      { text: "여름 사이버강의 계절학기 개강", department: "교학실(대학)" },
    ],
    26: [{ text: "후기 대학원 합격자 발표", department: "교학실(대학원)" }],
    30: [{ text: "서울오라토리오페스티발", department: "교학실(대학)" }],
  },
  "2025-07": {
    1: [{ text: "재학생 성경종합고사", department: "교학실(대학, 신대원)" }],
    7: [
      { text: "석사, 목회신학박사 종합시험", department: "교학실(대학원)" },
      { text: "신학박사 종합시험", department: "교학실(대학원)" },
      { text: "재입학 신청", department: "교학실(대학)" },
    ],
    14: [{ text: "석·박사과정 외국어시험", department: "교학실(대학원)" }],
    23: [{ text: "후기 대학원 등록", department: "교학실(대학원)" }],
    25: [{ text: "제124주년 개교기념 대체휴무일", department: "행정실" }],
    28: [
      {
        text: "계절학기 성적열람 및 성적 이의 신청",
        department: "교학실(대학)",
      },
    ],
  },
  "2025-08": {
    1: [{ text: "수강신청", department: "교학실(대학, 신대원, 대학원)" }],
    4: [{ text: "석·박사과정 종합시험 재시험", department: "교학실(대학원)" }],
    7: [
      { text: "제118회 후기 졸업", department: "교학실(대학, 신대원, 대학원)" },
    ],
    11: [
      { text: "장서정검", department: "학술연구지원실(도서관)" },
      { text: "논문 추가신청기간", department: "교학실(대학원)" },
    ],
    18: [
      { text: "조교교육", department: "교수학습개발원" },
      { text: "1차 등록금 납부", department: "행정실(경리)" },
    ],
    22: [{ text: "개강교수회의", department: "교학실(신대원)" }],
    25: [
      { text: "대학원 개강감사예배, 세미나", department: "교학실(대학원)" },
      { text: "개강", department: "교학실(대학, 신대원, 대학원)" },
    ],
    26: [
      {
        text: "개강감사예배(10:30)",
        department: "경건교육실, 교학실(대학, 신대원)",
      },
    ],
    28: [
      {
        text: "장애학생 오찬만남 및 학습튜터 활동안내",
        department: "교수학습개발원",
      },
      { text: "추가시험", department: "교학실(대학, 신대원, 대학원)" },
    ],
    29: [
      {
        text: "복학생 신학생활4 오리엔테이션 및 기관신청",
        department: "학생지원실",
      },
    ],
  },
  "2025-09": {
    1: [{ text: "개강감사예배", department: "평생교육원" }],
    3: [{ text: "대학생활 첫모임", department: "교학실(대학)" }],
    5: [{ text: "수업도우미교육", department: "교수학습개발원" }],
    10: [
      { text: "학습법 특강", department: "교수학습개발원" },
      { text: "신학생활 모임", department: "교학실(신대원)" },
      { text: "진로연계 첫모임", department: "교학실(대학)" },
    ],
    15: [{ text: "수업 1/5선", department: "교학실(대학, 신대원, 대학원)" }],
    16: [
      {
        text: "두런두런 학습공동체 오리엔테이션",
        department: "교수학습개발원",
      },
    ],
    17: [
      {
        text: "가을 신앙사경회",
        department: "경건교육실, 교학실(대학, 신대원)",
      },
    ],
    19: [{ text: "응급처치 및 심폐소생술 교육", department: "교학실(대학)" }],
    24: [
      { text: "제20회 춘계 이종성 신학강좌", department: "학술연구지원실" },
      { text: "교직 적성 및 인성검사", department: "교학실(대학)" },
    ],
  },
};
export const holidays = {
  // 2025년 공휴일
  "2025-01-01": "신정",
  "2025-02-08": "설날 연휴",
  "2025-02-09": "설날",
  "2025-02-10": "설날 연휴",
  "2025-03-01": "삼일절",
  "2025-05-01": "근로자의 날",
  "2025-05-05": "어린이날",
  "2025-05-06": "대체공휴일(어린이날)",
  "2025-05-08": "부처님오신날",
  "2025-06-06": "현충일",
  "2025-08-15": "광복절",
  "2025-10-05": "추석 연휴",
  "2025-10-06": "추석",
  "2025-10-07": "추석 연휴",
  "2025-10-03": "개천절",
  "2025-10-09": "한글날",
  "2025-12-25": "크리스마스",

  // 2026년 공휴일
  "2026-01-01": "신정",
  "2026-01-28": "설날 연휴",
  "2026-01-29": "설날",
  "2026-01-30": "설날 연휴",
  "2026-03-01": "삼일절",
  "2026-05-01": "근로자의 날",
  "2026-05-05": "어린이날",
  "2026-05-27": "부처님오신날",
  "2026-06-06": "현충일",
  "2026-08-15": "광복절",
  "2026-09-24": "추석 연휴",
  "2026-09-25": "추석",
  "2026-09-26": "추석 연휴",
  "2026-10-03": "개천절",
  "2026-10-09": "한글날",
  "2026-12-25": "크리스마스",
};
